КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектронныйЗаказНаряд/КонтурЛогистика_ЭлектронныйЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектронныйЗаказНаряд</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗН</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗН</name>
    <comment>Дата оформления документа.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтователь</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтовщик</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовщикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДатВрПодТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПодачи</name>
    <comment>Место подачи ТС</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияПеревозки</name>
    <comment>СвСрокВыпПрвз</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриПогрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриВыгрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПереадресовок</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменВодителей</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменТС</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗН_Титул3/КонтурЛогистика_ЗН_Титул3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗН_Титул3</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_ЗН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗН</name>
    <comment>Главный документ для ЗН</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфФщ</name>
    <comment>Дата формирования файла обмена информации фрахтовщика</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфФщ</name>
    <comment>Время формирования файла обмена информации Фрахтовщика</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфФщ</name>
    <comment>Идентификатор файла обмена информации Фрахтовщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПФщ</name>
    <comment>Электронная подпись файла обмена информации Фрахтовщика</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПодТС</name>
    <comment>Фактические дата и время подачи транспортного средства</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтметкиФрахтователя</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОтметки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбстоятельств</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктЭтоАктВзвешивания</name>
      <comment>Если истина - то будет отправелен в СвАктВзв. Если ложь - в СвАкт</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктИдДок</name>
      <comment>Идентификатор файла документа (в том числе регистрационный номер, если документ / сведения о таком документе содержатся в государственных информационных системах)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АктДопСведДок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтороныСоставители</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйСоставитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрафы</name>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактКолЕдИзм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогРазмШтрРФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчШтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОтметки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектронныйЗаказНаряд/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НомерЗН");
	Поля.Добавить("ДатаЗН");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НомерЗН = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(Данные.НомерЗН);
	Представление = "ЗН №" + НомерЗН + " от " + Формат(Данные.ДатаЗН, "ДФ=dd.MM.yy");
	
КонецПроцедуры

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("НомерЗН");
	МассивОбязательных.Добавить("ДатаЗН");
	МассивОбязательных.Добавить("Фрахтователь");
	МассивОбязательных.Добавить("Фрахтовщик");
	МассивОбязательных.Добавить("МестоПодачи");
	МассивОбязательных.Добавить("Маршрут");
	МассивОбязательных.Добавить("МаршрутДатВрПодТС");
	МассивОбязательных.Добавить("СрокВыполненияПеревозки");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	// в этом документе нет
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	// в этом документе нет
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

// Допроверяет то что не проверено вызовом МассивОбязательныхРеквизитов
Процедура ПроверитьКлючевыеРеквизиты(ДокЗНСсылка, ТаблицаОшибок) Экспорт
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	
	// ИНН
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтователь.ИНН) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтователе ИНН (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтователь.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;			
			
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтовщик.ИНН) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтовщике ИНН (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтовщик.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	// НаименованиеОрганизацииПолное
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтователь.НаименованиеОрганизацииПолное) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтователь Полное наименование (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтователь.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;			
			
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтовщик.НаименованиеОрганизацииПолное) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтовщик Полное наименование (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтовщик.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;
		
	// Телефоны
	
	
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЗНСсылка.Фрахтователь) Тогда 
	
		ТекстОшибки = "Укажите Телефон Фрахтователь";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтователь.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;			
			
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(ДокЗНСсылка.Фрахтовщик) Тогда 
	
		ТекстОшибки = "Укажите Телефон Фрахтовщик";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтовщик.Телефон", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;
		
	// ИдентификаторУчастникаЭДО
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтователь.ИдентификаторУчастникаЭДО) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтователь Идентификатор участника ЭДО (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтователь.ИдентификаторУчастникаЭДО", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;			
			
	Если Не ЗначениеЗаполнено(ДокЗНСсылка.Фрахтовщик.ИдентификаторУчастникаЭДО) Тогда 
	
		ТекстОшибки = "Укажите в Фрахтовщик Идентификатор участника ЭДО (в Документе электронного Заказ-Наряда)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ГлавныйДокумент.Фрахтовщик.ИдентификаторУчастникаЭДО", КатегорияОшибка, ТекстОшибки, "Указать");
			
	КонецЕсли;
		
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьАдресПунктаМаршрута(
		ДокЗНСсылка.МестоПодачи,
		ТаблицаОшибок,
		"ГлавныйДокумент.МестоПодачи",
		"Укажите адрес места подачи в его карточке",
		КатегорияОшибка);
	
	
КонецПроцедуры

Функция ПоследнийПоДатеТитул(ДокЗНСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ТрН_Титул1.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ЗН_Титул1.Дата КАК Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул1 КАК КонтурЛогистика_ЗН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул1.ДокументЗН = &ДокументЗН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗН_Титул2.Ссылка,
	|	КонтурЛогистика_ЗН_Титул2.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул2 КАК КонтурЛогистика_ЗН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул2.ДокументЗН = &ДокументЗН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗН_Титул3.Ссылка,
	|	КонтурЛогистика_ЗН_Титул3.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул3 КАК КонтурЛогистика_ЗН_Титул3
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул3.ДокументЗН = &ДокументЗН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ЗН_Титул4.Ссылка,
	|	КонтурЛогистика_ЗН_Титул4.Дата
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул4 КАК КонтурЛогистика_ЗН_Титул4
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул4.ДокументЗН = &ДокументЗН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументЗН", ДокЗНСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
	
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСледующийПоЦепочкеТипТитулаЗН(ДокЗНСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокЗНСсылка) Тогда 
		ВызватьИсключение "Не заполнен ЗН - не могу определить титул";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул2) КАК ТипТитула
	|ПОМЕСТИТЬ ВТ_ВсеТитулыЗН
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул1 КАК КонтурЛогистика_ЗН_Титул1
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул1.ДокументЗН = &ДокументЗН
	|	И НЕ КонтурЛогистика_ЗН_Титул1.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул3)
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул2 КАК КонтурЛогистика_ЗН_Титул2
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул2.ДокументЗН = &ДокументЗН
	|	И НЕ КонтурЛогистика_ЗН_Титул2.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул4)
	|ИЗ
	|	Документ.КонтурЛогистика_ЗН_Титул3 КАК КонтурЛогистика_ЗН_Титул3
	|ГДЕ
	|	КонтурЛогистика_ЗН_Титул3.ДокументЗН = &ДокументЗН
	|	И НЕ КонтурЛогистика_ЗН_Титул3.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеТитулыЗН.ТипТитула КАК ТипТитула
	|ИЗ
	|	ВТ_ВсеТитулыЗН КАК ВТ_ВсеТитулыЗН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипТитула УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументЗН", ДокЗНСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипТитула;
	Иначе
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
